zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz2038ca70064.h
typedef enum
{
  ACC_ID_0 = ((uint32_t)_ACC_BASE_ADDRESS),
  ACC_NUMBER_OF_MODULES = 1
} ACC_MODULE_ID;

typedef enum
{
  AES_ID_0 = ((uint32_t)_AES_BASE_ADDRESS),
  AES_NUMBER_OF_MODULES = 1
} AES_MODULE_ID;

typedef enum
{
  AFEC_ID_0 = ((uint32_t)_AFEC0_BASE_ADDRESS),
  AFEC_ID_1 = ((uint32_t)_AFEC1_BASE_ADDRESS),
  AFEC_NUMBER_OF_MODULES = 2
} AFEC_MODULE_ID;

typedef enum
{
  CHIPID_ID_0 = ((uint32_t)_CHIPID_BASE_ADDRESS),
  CHIPID_NUMBER_OF_MODULES = 1
} CHIPID_MODULE_ID;

typedef enum
{
  DACC_ID_0 = ((uint32_t)_DACC_BASE_ADDRESS),
  DACC_NUMBER_OF_MODULES = 1
} DACC_MODULE_ID;

typedef enum
{
  EFC_ID_0 = ((uint32_t)_EFC_BASE_ADDRESS),
  EFC_NUMBER_OF_MODULES = 1
} EFC_MODULE_ID;

typedef enum
{
  GMAC_ID_0 = ((uint32_t)_GMAC_BASE_ADDRESS),
  GMAC_NUMBER_OF_MODULES = 1
} GMAC_MODULE_ID;

typedef enum
{
  GPBR_ID_0 = ((uint32_t)_GPBR_BASE_ADDRESS),
  GPBR_NUMBER_OF_MODULES = 1
} GPBR_MODULE_ID;

typedef enum
{
  HSMCI_ID_0 = ((uint32_t)_HSMCI_BASE_ADDRESS),
  HSMCI_NUMBER_OF_MODULES = 1
} HSMCI_MODULE_ID;

typedef enum
{
  ICM_ID_0 = ((uint32_t)_ICM_BASE_ADDRESS),
  ICM_NUMBER_OF_MODULES = 1
} ICM_MODULE_ID;

typedef enum
{
  ISI_ID_0 = ((uint32_t)_ISI_BASE_ADDRESS),
  ISI_NUMBER_OF_MODULES = 1
} ISI_MODULE_ID;

typedef enum
{
  MATRIX_ID_0 = ((uint32_t)_MATRIX_BASE_ADDRESS),
  MATRIX_NUMBER_OF_MODULES = 1
} MATRIX_MODULE_ID;

typedef enum
{
  MCAN_ID_0 = ((uint32_t)_MCAN0_BASE_ADDRESS),
  MCAN_ID_1 = ((uint32_t)_MCAN1_BASE_ADDRESS),
  MCAN_NUMBER_OF_MODULES = 2
} MCAN_MODULE_ID;

typedef enum
{
  MLB_ID_0 = ((uint32_t)_MLB_BASE_ADDRESS),
  MLB_NUMBER_OF_MODULES = 1
} MLB_MODULE_ID;

typedef enum
{
  PORTS_ID_0 = ((uint32_t)_PORTA_BASE_ADDRESS),
  PORTS_ID_1 = ((uint32_t)_PORTB_BASE_ADDRESS),
  PORTS_ID_2 = ((uint32_t)_PORTD_BASE_ADDRESS),
  PORTS_NUMBER_OF_MODULES = 3
} PORTS_MODULE_ID;

typedef enum
{
  PMC_ID_0 = ((uint32_t)_PMC_BASE_ADDRESS),
  PMC_NUMBER_OF_MODULES = 1
} PMC_MODULE_ID;

typedef enum
{
  PWMC_ID_0 = ((uint32_t)_PWMC0_BASE_ADDRESS),
  PWMC_ID_1 = ((uint32_t)_PWMC1_BASE_ADDRESS),
  PWMC_NUMBER_OF_MODULES = 2
} PWMC_MODULE_ID;

typedef enum
{
  QSPI_ID_0 = ((uint32_t)_QSPI_BASE_ADDRESS),
  QSPI_NUMBER_OF_MODULES = 1
} QSPI_MODULE_ID;

typedef enum
{
  RSTC_ID_0 = ((uint32_t)_RSTC_BASE_ADDRESS),
  RSTC_NUMBER_OF_MODULES = 1
} RSTC_MODULE_ID;

typedef enum
{
  RSWDT_ID_0 = ((uint32_t)_RSWDT_BASE_ADDRESS),
  RSWDT_NUMBER_OF_MODULES = 1
} RSWDT_MODULE_ID;

typedef enum
{
  RTC_ID_0 = ((uint32_t)_RTC_BASE_ADDRESS),
  RTC_NUMBER_OF_MODULES = 1
} RTC_MODULE_ID;

typedef enum
{
  RTT_ID_0 = ((uint32_t)_RTT_BASE_ADDRESS),
  RTT_NUMBER_OF_MODULES = 1
} RTT_MODULE_ID;

typedef enum
{
  SSC_ID_0 = ((uint32_t)_SSC_BASE_ADDRESS),
  SSC_NUMBER_OF_MODULES = 1
} SSC_MODULE_ID;

typedef enum
{
  SUPC_ID_0 = ((uint32_t)_SUPC_BASE_ADDRESS),
  SUPC_NUMBER_OF_MODULES = 1
} SUPC_MODULE_ID;

typedef enum
{
  TC_ID_0 = ((uint32_t)_TC0_BASE_ADDRESS),
  TC_ID_1 = ((uint32_t)_TC1_BASE_ADDRESS),
  TC_ID_2 = ((uint32_t)_TC2_BASE_ADDRESS),
  TC_ID_3 = ((uint32_t)_TC3_BASE_ADDRESS),
  TC_NUMBER_OF_MODULES = 4
} TC_MODULE_ID;

typedef enum
{
  TRNG_ID_0 = ((uint32_t)_TRNG_BASE_ADDRESS),
  TRNG_NUMBER_OF_MODULES = 1
} TRNG_MODULE_ID;

typedef enum
{
  TWI_ID_0 = ((uint32_t)_TWI0_BASE_ADDRESS),
  TWI_ID_1 = ((uint32_t)_TWI1_BASE_ADDRESS),
  TWI_NUMBER_OF_MODULES = 2
} TWI_MODULE_ID;

typedef enum
{
  UART_ID_0 = ((uint32_t)_UART0_BASE_ADDRESS),
  UART_ID_1 = ((uint32_t)_UART1_BASE_ADDRESS),
  UART_ID_2 = ((uint32_t)_UART2_BASE_ADDRESS),
  UART_ID_3 = ((uint32_t)_UART3_BASE_ADDRESS),
  UART_ID_4 = ((uint32_t)_UART4_BASE_ADDRESS),
  UART_NUMBER_OF_MODULES = 5
} UART_MODULE_ID;

typedef enum
{
  USART_ID_0 = ((uint32_t)_USART0_BASE_ADDRESS),
  USART_ID_1 = ((uint32_t)_USART1_BASE_ADDRESS),
  USART_ID_2 = ((uint32_t)_USART2_BASE_ADDRESS),
  USART_NUMBER_OF_MODULES = 3
} USART_MODULE_ID;

typedef enum
{
  USBHS_ID_0 = ((uint32_t)_USBHS_BASE_ADDRESS),
  USBHS_NUMBER_OF_MODULES = 1
} USBHS_MODULE_ID;

typedef enum
{
  UTMI_ID_0 = ((uint32_t)_UTMI_BASE_ADDRESS),
  UTMI_NUMBER_OF_MODULES = 1
} UTMI_MODULE_ID;

typedef enum
{
  WDT_ID_0 = ((uint32_t)_WDT_BASE_ADDRESS),
  WDT_NUMBER_OF_MODULES = 1
} WDT_MODULE_ID;

typedef enum
{
  XDMAC_ID_0 = ((uint32_t)_XDMAC_BASE_ADDRESS),
  XDMAC_NUMBER_OF_MODULES = 1
} XDMAC_MODULE_ID;

/** @}  end of Peripheral Base Address Definitions */

/** \addtogroup PIC32CZ2038CA70064_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CZ2038CA70064                                   */
/* ************************************************************************** */
#include "pio/pic32cz2038ca70064.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CZ2038CA70064                        */
/* ************************************************************************** */

#define PERIPHERALS_SIZE               (0x20000000U)       /* 524288kB Memory segment type: io */
#define SYSTEM_SIZE                    (0x10000000U)       /* 262144kB Memory segment type: io */
#define QSPIMEM_SIZE                   (0x20000000U)       /* 524288kB Memory segment type: other */
#define AXIMX_SIZE                     (0x00100000U)       /* 1024kB Memory segment type: other */
#define ITCM_SIZE                      (0x00200000U)       /* 2048kB Memory segment type: other */
#define IFLASH_SIZE                    (0x00200000U)       /* 2048kB Memory segment type: flash */
#define IFLASH_PAGE_SIZE                      (512U)
#define IFLASH_NB_OF_PAGES                   (4096U)

#define IROM_SIZE                      (0x00004000U)       /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      (0x00020000U)       /*  128kB Memory segment type: other */
#define IRAM_SIZE                      (0x00060000U)       /*  384kB Memory segment type: ram */

#define PERIPHERALS_ADDR               (0x40000000U)       /**< PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR                    (0xe0000000U)       /**< SYSTEM base address (type: io)*/
#define QSPIMEM_ADDR                   (0x80000000U)       /**< QSPIMEM base address (type: other)*/
#define AXIMX_ADDR                     (0xa0000000U)       /**< AXIMX base address (type: other)*/
#define ITCM_ADDR                      (0x00000000U)       /**< ITCM base address (type: other)*/
#define IFLASH_ADDR                    (0x00400000U)       /**< IFLASH base address (type: flash)*/
#define IROM_ADDR                      (0x00800000U)       /**< IROM base address (type: rom)*/
#define DTCM_ADDR                      (0x20000000U)       /**< DTCM base address (type: other)*/
#define IRAM_ADDR                      (0x20400000U)       /**< IRAM base address (type: ram)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR PIC32CZ2038CA70064                                 */
/* ************************************************************************** */
#define CHIP_JTAGID                    (0x05b3d03fUL)
#define CHIP_CIDR                      (0xa1020e00UL)
#define CHIP_EXID                      (0x00000000UL)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR PIC32CZ2038CA70064 */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN               (20000UL)
#define CHIP_FREQ_SLCK_RC                   (32000UL)      /**< \brief Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX               (44000UL)
#define CHIP_FREQ_MAINCK_RC_4MHZ          (4000000UL)
#define CHIP_FREQ_MAINCK_RC_8MHZ          (8000000UL)
#define CHIP_FREQ_MAINCK_RC_12MHZ        (12000000UL)
#define CHIP_FREQ_CPU_MAX               (300000000UL)
#define CHIP_FREQ_XTAL_32K                  (32768UL)
#define CHIP_FREQ_XTAL_12M               (12000000UL)
#define CHIP_FREQ_FWS_0                  (23000000UL)      /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                  (46000000UL)      /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                  (69000000UL)      /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                  (92000000UL)      /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                 (115000000UL)      /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                 (138000000UL)      /**< \brief Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                 (150000000UL)      /**< \brief Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER                    (7UL)      /**< \brief Number of FWS ranges */

#ifdef __cplusplus
}
#endif

/** @}  end of PIC32CZ2038CA70064 definitions */


#endif /* _PIC32CZ2038CA70064_H_ */
